artillery/loadtest.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 20 # 20 new virtual users per second
  defaults:
    headers:
      Accept: "application/json"
      Content-Type: "application/json"

scenarios:
  - name: Get public lists
    flow:
      - get:
          url: "/api/portfolio?isActive=true"
      - get:
          url: "/api/clients"
      - get:
          url: "/api/testimonials"